# frozen_string_literal: true

# tap 'homebrew/core'
tap 'homebrew/bundle'
if OS.mac?
  tap 'homebrew/cask'
  tap 'buo/cask-upgrade'
end

brew 'gawk'
brew 'gnu-sed'
brew 'llvm'
brew 'rbenv'
brew 'sheldon'

return unless OS.mac?

brew 'pinentry_mac'

# fonts
tap 'ryota2357/pleck-jp'
cask 'pleck-jp'

cask 'alacritty'
cask 'alfred'
cask 'alt-tab'
cask 'arc'
cask 'brave-browser'
cask 'chatgpt'
cask 'coteditor'
cask 'deepl'
cask 'discord'
cask 'docker'
cask 'dotnet-sdk'
cask 'firefox'
cask 'font-cica'
cask 'font-hack-nerd-font'
cask 'font-harano-aji'
cask 'font-plemol-jp-nf'
cask 'fontforge'
cask 'github'
cask 'google-chrome'
cask 'hiddenbar'
cask 'iina'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'keycastr'
cask 'microsoft-edge'
cask 'notion'
cask 'numi'
cask 'obs'
cask 'ollama'
cask 'osu'
cask 'qtspim'
cask 'r'
cask 'rstudio'
cask 'skim'
cask 'slack'
cask 'unity-hub'
cask 'visual-studio-code'
cask 'wezterm'
cask 'wireshark'
cask 'xmind'
cask 'xquartz'
cask 'zoom'

# vim: ft=ruby
