# frozen_string_literal: true

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'

# brew cu
tap 'buo/cask-upgrade'

brew 'bats-core'
brew 'cloc'
brew 'cmake'
brew 'doxygen'
brew 'exercism'
brew 'ffmpeg'
brew 'gawk'
brew 'gcc'
brew 'git'
brew 'gnu-sed'
brew 'gnuplot'
brew 'gpg'
brew 'gtk+3'
brew 'libsixel'
brew 'llvm'
brew 'neovim', args: ['HEAD']
brew 'ninja'
brew 'openjdk'
brew 'pdf2svg'
brew 'pdftk-java'
brew 'php'
brew 'pinentry-mac'
brew 'plantuml'
brew 'pstree'
brew 'rbenv'
brew 'rustup-init'
brew 'rye'
brew 'sheldon'
brew 'spim'
brew 'texlive'
brew 'tmux'
brew 'tree'
brew 'typst'
brew 'vim'
brew 'volta'
brew 'wget'
brew 'yt-dlp'
brew 'zlib'
brew 'zsh'

# aqua
tap 'aquaproj/aqua'
brew 'aquaproj/aqua/aqua'

# dart
tap 'dart-lang/dart'
brew 'dart-lang/dart/dart'

# fonts
tap 'homebrew/cask-fonts'
tap 'ryota2357/pleck-jp'
cask 'font-cica'
cask 'font-hack-nerd-font'
cask 'font-harano-aji'
cask 'font-plemol-jp-nf'
cask 'pleck-jp'

cask 'alacritty'
cask 'alfred'
cask 'alt-tab'
cask 'arc'
cask 'brave-browser'
cask 'coteditor'
cask 'deepl'
cask 'discord'
cask 'docker'
cask 'dotnet-sdk'
cask 'figma'
cask 'firefox'
cask 'fontforge'
cask 'github'
cask 'google-chrome'
cask 'grammarly'
cask 'hiddenbar'
cask 'iina'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'keycastr'
cask 'microsoft-edge'
cask 'notion'
cask 'numi'
cask 'obs'
cask 'ollama'
cask 'osu'
cask 'qtspim'
cask 'r'
cask 'rstudio'
cask 'skim'
cask 'slack'
cask 'unity-hub'
cask 'visual-studio-code'
cask 'wezterm'
cask 'xmind'
cask 'zoom'

# vim: ft=ruby
