# frozen_string_literal: true

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'

# brew cu
tap 'buo/cask-upgrade'

brew 'act'
brew 'arduino-cli'
brew 'bat'
brew 'bats-core'
brew 'cloc'
brew 'cmake'
brew 'deno'
brew 'doxygen'
brew 'exercism'
brew 'ffmpeg'
brew 'fontforge'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gh'
brew 'ghq'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'gotop'
brew 'gtk+3'
brew 'jq'
brew 'llvm'
brew 'minicom'
brew 'mono'
brew 'neovim'
brew 'node'
brew 'nodebrew'
brew 'openjdk'
brew 'pdftk-java'
brew 'peco'
brew 'php'
brew 'plantuml'
brew 'prettier'
brew 'pstree'
brew 'pyenv'
brew 'rbenv'
brew 'ripgrep'
brew 'rustup-init'
brew 'sheldon'
brew 'spim'
brew 'texlive'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zlib'
brew 'zsh'

# dart
tap 'dart-lang/dart'
brew 'dart-lang/dart/dart'

# fonts
tap 'homebrew/cask-fonts'
tap 'ryota2357/pleck-jp'
cask 'font-cica'
cask 'font-hack-nerd-font'
cask 'font-plemol-jp-nf'
cask 'pleck-jp'

cask 'alacritty'
cask 'alfred'
cask 'alt-tab'
cask 'arduino-ide'
cask 'coteditor'
cask 'deepl'
cask 'discord'
cask 'docker'
cask 'dotnet-sdk'
cask 'figma'
cask 'firefox'
cask 'fontforge'
cask 'github'
cask 'google-chrome'
cask 'grammarly'
cask 'hiddenbar'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'keycastr'
cask 'microsoft-auto-update'
cask 'microsoft-edge'
cask 'microsoft-office'
cask 'mono-mdk-for-visual-studio'
cask 'notion'
cask 'numi'
cask 'qtspim'
cask 'skim'
cask 'slack'
cask 'unity-hub'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'wezterm'
cask 'zoom'

# vim: ft=ruby
